Revit 2027 API
PlumbingUtils.ConvertPipePlaceholders Method
 Converts a collection of pipe placeholder elements into pipe elements.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> ConvertPipePlaceholders(
	Document document,
	ICollection<ElementId> placeholderIds
)
Public Shared Function ConvertPipePlaceholders (
	document As Document,
	placeholderIds As ICollection(Of ElementId)
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ ConvertPipePlaceholders(
	Document^ document,
	ICollection<ElementId^>^ placeholderIds
)
static member ConvertPipePlaceholders :
        document : Document *
        placeholderIds : ICollection<ElementId> -> ICollection<ElementId>
Parameters
document Document
 The document.
placeholderIds ICollection<ElementId>
 A collection of element IDs of pipe placeholders.
Return Value
ICollection<ElementId>
 A collection of element IDs of pipe and fitting.
Exceptions
Exception | Condition
ArgumentException |  The given element id set is empty. -or- The given element ids (placeholderIds) are not pipe placeholders. -or- The elements belong to different types of system.
ArgumentNullException |  A non-optional argument was null
Remarks
 Once conversion succeeds, the pipe placeholder elements are deleted. The new pipe and fitting elements are created and connections are established.
See Also
Reference
PlumbingUtils Class
Autodesk.Revit.DB.Plumbing Namespace